#1 დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.

n = eval(input("შეიყვანეთ რიცხვი: "))
sum = 0

for i in range(n+1):
    sum += i

print(sum)

#2 დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" ციკლს რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. 
#მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1

n = eval(input("შეიყვანეთ რიცხვი: "))

while (n != 0):
    print(n)
    n -= 1

#3 დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს 
#მომხმარებელს გამოიცნოს წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.

import random

rand = random.randint(1, 10)
n = 0

while (rand != n):
    n = int(input("გამოიცანით რიცხვი: "))
    if (rand != n):
        print("ვერ გამოიცანით")
        if(rand > n):
            print("შეიყვანეთ უფრო მაღალი")
        else:
            print("შეიყვანეთ უფრო დაბალი")
    
    
print("გამოიცანით")



#4 დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია,
#მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.

sum = 0

while(True):
    n1 = input("შეიყანეთ რიცხვი ")
    if n1 == "sum":
        break
    
    n2 = int(n1)
    
    if n2 > 0:
        sum += n2
    
    
print(sum)
